han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
#include "app_comm_NB86.h"
#include "nrf_drv_gpiote.h"
#include "nrf_delay.h"

static uint16_t NB_msCount = 0;

uint8_t                                 g_Rx_Buffer[BUFFSIZE] = {0};
uint8_t                                 g_Tx_Buffer[BUFFSIZE] = {0};

NB_Handler        g_stNB_Handler;
PACKET_HEAD_Type  PacketHead;

typedef void(*NB_State_Fun)(uint8_t *RxBuf); /* 定义状态处理函数*/
//typedef void(*GPRS_State_Fun)(void);
//static void APP_NB_RefreshRetryMess(void);
static uint8_t APP_NB_EvtTraverse(uint8_t mode);


static void APP_NB_State_Init_Proc(uint8_t *RxBuf);
static void APP_NB_State_Connect_Proc(uint8_t *RxBuf);
static void APP_NB_State_Mess_Proc(uint8_t *RxBuf);
static void APP_NB_State_Comm_Proc(uint8_t *RxBuf);

static const NB_State_Fun APP_NB_StateProcTbl[] = 
{
    NULL,     //POWER_ON
    NULL,     //RESET
    APP_NB_State_Init_Proc,
		APP_NB_State_Connect_Proc,
		APP_NB_State_Mess_Proc,
		APP_NB_State_Comm_Proc,
		NULL,
    NULL,
    NULL,
    NULL,
};


/******************GPRS指令集**********************************/
const NB_Cmd_Data_Type AT_CmdTbl[] = 
{
    /*------cmdstr-----------------------------------revtimeout(s)--cmdtruebackstr----------retry_times */
    /************************* GPRS  network ***************************/
      {"AT+CFUN=0\r\n",                                  3,       "OK",                     3},
			{"AT+CFUN=1\r\n",                                  3,       "OK",                     3},
      {"AT+CFUN?\r\n",                                   3,       "CFUN:0",                 3},
			{"AT+CFUN?\r\n",                                   3,       "CFUN:1",                 3},
			{"AT+NCDP=180.101.147.115,5683\r\n",               3,       "OK",                     3},
			{"AT+NRB\r\n",                                     3,       "REBOOTING",              3},
			
			{"AT+CGSN=1\r\n",                                  3,       "CGSN",                   3},
			{"AT+NCSEARFCN\r\n",                               3,       "OK",                     3},
			{"AT+NCONFIG=CELL_RESELECTION,TRUE\r\n",           3,       "OK",                     3},
			{"AT+NCONFIG=CELL_RESELECTION,FALSE\r\n",          3,       "OK",                     3},
			{"AT+CMEE=1\r\n",                                  3,       "OK",                     3},
			{"AT+NCCID\r\n",                                   3,       "CCID:",                  3},
			
			{"AT+CGDCONT=1,\"IP\",\"ctnet\"\r\n",              3,       "OK",                     3},
			{"AT+CGATT=1\r\n",                                 3,       "OK",                     3},
			{"AT+CGATT=0\r\n",                                 3,       "OK",                     3},
			{"AT+CGATT?\r\n",                                  5,       "CGATT:1",               20},	
			{"AT+CGATT?\r\n",                                  5,       "CGATT:0",               20},	
			{"AT+CPSMS=1,,,01000011,01000011\r\n",             3,       "OK",                     3},
			{"AT+CEDRXS=0,5,0101\r\n",                         3,       "OK",                     3},
			{"AT+NPSMR=1\r\n",                                 3,       "OK",                     3},
			{"AT+CGPADDR\r\n",                                 5,       "OK",                    20},	
      
			{"AT+CSQ\r\n",   			                             3,	      "+CSQ",         	        3},
      {"AT+NMGS=37,00\r\n",   			                     3,	      "OK",         	          3},
      {"AT+NQMGS\r\n",   			                           3,	      "OK",         	          3},
			
      {"AT+NMGR\r\n",   			                           3,	      "OK",         	          3},			
			{"AT+NQMGR\r\n",   			                           3,	      "OK",         	          3},	

			{"AT+NPSMR?\r\n",   			                         3,	      "NPSMR:1,1",         	    3},				
			
};

/*************************初始化流程***************************/
static const uint8_t s_ATCmdStep_Init[] = 
{
    NULL,
    NB_AT_CFUN_0,      
		NB_AT_CFUN0,      
		NB_AT_NCDP, 
		NB_AT_NRB,	
};

/************************* TCP/IP数据链路建立连接***************************/
static const uint8_t s_ATCmdStep_Connnect[] = 
{
		NB_AT_CGDCONT,
		NB_AT_CSQ,
		NB_AT_CGATT_1,
		NB_AT_CGATT1,	
	  NB_AT_CFUN_0, 
		NB_AT_CFUN0,  
		NB_AT_CPSMS_1,
		NB_AT_CEDRXS_0,
		NB_AT_NPSMR_1,
	  NB_AT_CFUN_1, 
		NB_AT_CFUN1,  
		NB_AT_CGATT_1,
		NB_AT_CGATT1,
		NB_AT_CGPADDR,
};

/*************************数据发送流程***************************/
static const uint8_t s_ATCmdStep_Comm[] = 
{
		NB_AT_CSQ,
    NB_AT_NMGS,
		NB_AT_NQMGS,   	
};

static const uint8_t s_ATCmdStep_Mess[] = 
{
    NULL,
	  NB_AT_CFUN_0, 
		NB_AT_CFUN0,  
		NB_AT_CGSN_1,
		NB_AT_NCSEARFCN,
		NB_AT_NCONFIG_TRUE,
		NB_AT_CMEE_1,	
		NB_AT_CFUN_1,
		NB_AT_CFUN1,
		NB_AT_NCCID,
};

static const uint8_t s_ATCmdStep_Inquire[] = 
{
		NB_AT_NPSMR1,
};

/*校验AT指令应答结果是否正确*/
static uint8_t APP_GPRS_ATCmdAckCheck(uint8_t *RxBuf)
{   
    if(Check_Strstr((char*)RxBuf, "Lierda", NB_ATCmdCB.ucRxLen) == true) //NB模块准备就绪推送
    {
        task_flag_struct.atReday_F = ENABLE;
        NB_ATCmdCB.RspType = RSP_TYPE_CMD;
		#if SEGGER_RTT_DEBUG_CMDPROC
				SEGGER_RTT_printf(0, "gprs model ready\r\n");
		#endif
				return BACK_TRUE;
    }
		#if SEGGER_RTT_DEBUG_CMDPROC
//			SEGGER_RTT_printf(0, (char*)RxBuf);
//			SEGGER_RTT_printf(0, NB_ATCmdCB.ExpResultStr);
//			SEGGER_RTT_printf(0, "\r\n");
		#endif
//    if(NB_ATCmdCB.ATCmdPt != NB_AT_MIPOPEN_1)//socket连接时,也有可能回复MIPSTAT: 1,1
//    {
//        if(Check_Strstr((char*)RxBuf, "MIPSTAT: 1,1", NB_ATCmdCB.ucRxLen) == true)
//        {
//            NB_NetPar.NetConnSta = CONN_OFF;
//            g_stNB_Handler.State = NB_STATE_CONNECT_NET;    //重新连接socket
//						g_stNB_Handler.StepPt = 2;
//						g_stNB_Handler.AuthStatus = NOT_AUTH;
//						NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_AUTH);
//        }
//    }
//    if(NB_ATCmdCB.ATCmdPt != NB_AT_MIPCALL1) //由于IP获取错误，也会去查询有无IP
//    {
//        if(Check_Strstr((char*)RxBuf, "MIPCALL: 0", NB_ATCmdCB.ucRxLen) == true)
//        
//        { 
//            NB_NetPar.NetConnSta = CONN_OFF;
//						g_stNB_Handler.State = NB_STATE_CONNECT_NET;    //重新连接网络
//						g_stNB_Handler.StepPt = 0;
//						g_stNB_Handler.AuthStatus = NOT_AUTH;
//						NB_Event_Set(NB_EvtProc.ucUploadEvt, COMM_Event_AUTH);
//        }
//    }
    
