han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
     //判断接收的数据是否含有期望应答
		if(Check_Strstr((char*)RxBuf, NB_ATCmdCB.ExpResultStr, NB_ATCmdCB.ucRxLen) == true)
		{
				NB_ATCmdCB.RspType = RSP_TYPE_CMD;//应答AT指令
			
				if((NB_AT_CFUN0 == NB_ATCmdCB.ATCmdPt) ||
					 (NB_AT_CFUN1 == NB_ATCmdCB.ATCmdPt) ||
					 (NB_AT_CGATT1 == NB_ATCmdCB.ATCmdPt) ||
					 (NB_AT_CGATT0 == NB_ATCmdCB.ATCmdPt))
				{
						if(Check_Strstr((char*)RxBuf, "OK", 20) != true)
						{
								#if SEGGER_RTT_DEBUG_CFUN || SEGGER_RTT_DEBUG_CGATT
										SEGGER_RTT_printf(0, "at+cfun?/at+cgatt? error !\r\n");
										SEGGER_RTT_printf(0, (char*)RxBuf);
								#endif	
								return BACK_ERROR;  
						}
						#if SEGGER_RTT_DEBUG_CFUN || SEGGER_RTT_DEBUG_CGATT
								SEGGER_RTT_printf(0, "at+cfun?/at+cgatt? ok !\r\n");
						#endif
				}
				
				if((NB_AT_CGSN_1 == NB_ATCmdCB.ATCmdPt) ||
					 (NB_AT_NCCID == NB_ATCmdCB.ATCmdPt) ||
				   (NB_AT_CSQ == NB_ATCmdCB.ATCmdPt))
				{
						if(Check_Strstr((char*)RxBuf, "OK", 65) != true)
						{
								#if SEGGER_RTT_DEBUG_CGSN || SEGGER_RTT_DEBUG_NCCID
										SEGGER_RTT_printf(0, "at+cgsn=1/at+nccid error !\r\n");
										SEGGER_RTT_printf(0, (char*)RxBuf);
								#endif	
								return BACK_ERROR;  
						}
						#if SEGGER_RTT_DEBUG_CGSN || SEGGER_RTT_DEBUG_NCCID
								SEGGER_RTT_printf(0, "at+cgsn=1/at+nccid ok !\r\n");
						#endif
				}
				if(NB_AT_CGPADDR == NB_ATCmdCB.ATCmdPt)
				{
						if(Check_Strstr((char*)RxBuf, ".", 30) != true)
						{
								return BACK_ERROR;  
						}
				}
				return BACK_TRUE;                 //接收到正确应答
		} 
    else
		{   
//				//由于获取网络侧地址和建立soctet连接都是分两条返回的，第一条都为"OK"
//				if((NB_ATCmdCB.ATCmdPt == NB_AT_MIPCALL_1) || NB_ATCmdCB.ATCmdPt == NB_AT_MIPOPEN_1)
//				{
//						if(Check_Strstr((char*)RxBuf, "OK", 4) == true)   //去掉这一句再试
//						{
//								return NO_BACK;   /*第一条"OK"返回正确，所以继续等待*/
//						}
//				}
			  //查询是否驻网成功，如不成功，那么等待3S，而不是返回错误，该条指令特殊
				if(NB_ATCmdCB.ATCmdPt == NB_AT_CGATT1) 
				{
						return NO_BACK;
				}
				return BACK_ERROR;   		
		}	
}

static uint8_t APP_NB_Transition(uint8_t *hex_data_buf, uint8_t len_hex, uint8_t *new_hex_data_buf, uint8_t *new_len_hex)
{
		
}

//static U8 APP_GPRS_Encrypt(u8 *hex_data_buf,u8 len_hex,u8 *new_hex_data_buf,u8 *new_len_hex)
//{
//  u8 len=0;
//  for(u8 i=0;i<len_hex;i++,len++)
//  {
//    switch(hex_data_buf[i])
//    {
//      case TRANSFER_CHAR1:
//              new_hex_data_buf[len]=TRANSFER_FLAG;
//              len++;
//              new_hex_data_buf[len]=TRANSFER_CHAR1_FLAG;
//              break;
//      case TRANSFER_CHAR2:
//              new_hex_data_buf[len]=TRANSFER_FLAG;
//              len++;
//              new_hex_data_buf[len]=TRANSFER_CHAR2_FLAG;
//              break;
//      default:
//              new_hex_data_buf[len]=hex_data_buf[i];
//              break;
//     }
//  }
//  *new_len_hex=len;
//  if(*new_len_hex<=GPRS_RX_BUFF_LEN){
//    return TRUE;
//  }
//  else{
//    return FALSE;
//  }
//}

//static void APP_GPRS_Data_Trope(u8 *hex_data_buf,u8 len_hex,u8 *new_hex_data_buf)
//{
//  u16 len_hex_cnt=0;
//  u16 len_temp=0;
//				
//  for(len_temp=0;len_hex_cnt<len_hex;len_hex_cnt++,len_temp++)      
//  {
//    if(hex_data_buf[len_hex_cnt]==TRANSFER_FLAG)
//    {
//      switch(hex_data_buf[len_hex_cnt+1])
//      {
//        case TRANSFER_CHAR1_FLAG:
//              new_hex_data_buf[len_temp]=TRANSFER_CHAR1;
//              len_hex_cnt++;
//              break;
//        case TRANSFER_CHAR2_FLAG:
//              new_hex_data_buf[len_temp]=TRANSFER_CHAR2;
//              len_hex_cnt++;
//              break;
//        default:
//        #if DEBUG_LOG
//              BSP_LOG("0x1b error\r\n");
//        #endif
//              break;
//      }
//    }
//    else
//    {
//       new_hex_data_buf[len_temp]=hex_data_buf[len_hex_cnt];
//    }
//  } 
//}
//static void APP_GPRS_GetSysStaMessPacket(U8 status,U8 *num,U8* Packet)
//{
//    U8 i=0;
//    U16 VoltValue=0;
//    i=*num;
//    if(status != CHARGE_DISABLE)
//    {
//           GPRS_SysStaMess.chargeTime = g_stCharge_Handler.ChargeTimCnt;    //充电时长
//           VoltValue = USB_Voltage_Value();
//           GPRS_SysStaMess.chargeVolt = Data16_2_BCD(VoltValue);
//           GPRS_SysStaMess.chargeElec = Data16_2_BCD(VoltValue*10);  
//    }
//    else
//    {
//           GPRS_SysStaMess.chargeTime = 0;
//           GPRS_SysStaMess.chargeVolt = 0;
//           GPRS_SysStaMess.chargeElec = 0;
//    }
//    GPRS_SysStaMess.refVolt   = Data16_2_BCD((u16)ADC_Vref_Calculate());
//    Packet[i++] = (GPRS_CommPacket.MessRead.DeviceState.state>>8) & 0xff;
//    Packet[i++] = (GPRS_CommPacket.MessRead.DeviceState.state) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeTime>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeTime) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeElec>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeElec) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeVolt>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.chargeVolt) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.refVolt>>8) & 0xff;
//    Packet[i++] = (GPRS_SysStaMess.refVolt) & 0xff;
//    *num = i;
//}

static uint16_t APP_NB_GetPacket(uint16_t messID, uint8_t* Packet)
{
    uint8_t i=0;
    uint8_t newLen = 0;
//    uint8_t TxBuf[NB_RX_BUFF_LEN]={0};
		ble_gap_addr_t device_addr;
		uint32_t err_code = 1;
		
    switch(messID)
    {
				case INIT_ID:
				{
					uint8_t MAC_ADDR[6];
						sprintf((char*)Packet, "%02x", 0);
						sprintf((char*)Packet+2, "%02x", gSystemRunParam.batterPercent);
						sprintf((char*)Packet+4, "%02x", NB_CommPacket.Init_Data.CSQ);
						sprintf((char*)Packet+6, "%02x", seconds_times >> 24);
						sprintf((char*)Packet+8, "%02x", seconds_times >> 16);
						sprintf((char*)Packet+10, "%02x", seconds_times >> 8);
						sprintf((char*)Packet+12, "%02x", seconds_times >> 0);
						for(i=0; i<20; i++)
						{
								sprintf((char*)TxBuf+14+2*i, "%02x", NB_CommPacket.Init_Data.iccid[i]);
						}
						sprintf((char*)Packet+56, "%02x", (uint8_t)(PROTOCOL_APP_VERSION >> 8));
						sprintf((char*)Packet+58, "%02x", (uint8_t)(PROTOCOL_APP_VERSION));
						sprintf((char*)Packet+60, "%02x", (uint8_t)(PROTOCOL_APP_SCENARIOS));
						sprintf((char*)Packet+62, "%02x", (uint8_t)(PROTOCOL_APP_VENDORCODE));
				#if (NRF_SD_BLE_API_VERSION == 3)
						err_code = sd_ble_gap_addr_get(&device_addr);

				#else
						err_code = sd_ble_gap_address_get(&device_addr);
				#endif
						for(i=0; i<6; i++)
						{
								sprintf((char*)Packet+64+2*i, "%02x", device_addr.addr[i]);
						}
						newLen = 78;
				}
						break;
			
