han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
				}
						break;
			
				default:
				{
						strcpy((char*)pFrameDes, AT_CmdTbl[ATCmdIndex].CmdStr);
						ucSendLen = strlen(AT_CmdTbl[ATCmdIndex].CmdStr);//默认的指令符长度
					
				}
						break;
		}
		return ucSendLen;    
}


static void APP_NB_SendATCmd(AT_CMD_CB* pNBATCmdCB)
{
		uint8_t ucResendCnt;
		uint8_t ATCmdIndex;
		AT_CMD_CB *pAtCmd = pNBATCmdCB;
		ATCmdIndex = pAtCmd->ATCmdPt;
		if(1 == pAtCmd->Busy)
		{
			return ;//当前忙碌状态
		}
		//根据不同的AT应答结果,设置重发次数
		if((BACK_TRUE == pAtCmd->ATCmdResult) || (BACK_PERTIMES_OUT == pAtCmd->ATCmdResult))
		{
				ucResendCnt = 0;//重发清零
		}
		else
		{
				ucResendCnt = NB_ATCmdCB.ucResendCnt;//备份重发次数
		}

		memset((uint8_t*)pAtCmd, 0, sizeof(NB_ATCmdCB));
		
		pAtCmd->Busy         = 1;          //设置忙绿状态
		pAtCmd->ATCmdPt      = ATCmdIndex; //更新AT索引号
		pAtCmd->ATCmdResult  = NO_BACK;
		pAtCmd->ucResendCnt  = ucResendCnt;  
		pAtCmd->ucResendTimes = AT_CmdTbl[ATCmdIndex].ucResendTimes;
		pAtCmd->ulTimeOut    = TmrSecondsToMilliseconds(AT_CmdTbl[ATCmdIndex].usTimeOut);//刷新超时时间

		////// 填充指令内容长度 //////
		pAtCmd->ucCmdStrLen = APP_NB_WriteATPacket(ATCmdIndex, pAtCmd->CmdStr);
		//填充指令符期望结果
		strcpy(pAtCmd->ExpResultStr, AT_CmdTbl[ATCmdIndex].ExpResultStr);
		//发送AT指令
		NB_SendATCmdStr(pAtCmd->CmdStr, pAtCmd->ucCmdStrLen);
		//发送次数+1
		pAtCmd->ucResendCnt++;
}

static void APP_NB_State_Init_Proc(uint8_t *RxBuf)
{
		uint8_t ATCmdIndex;
		if(g_stNB_Handler.StepPt >= INIT_STEP_NUM)
		{
				return;	
		}	 
		ATCmdIndex = s_ATCmdStep_Init[g_stNB_Handler.StepPt];
		//////////////////////// AT指令应答正确 ///////////////////////////	
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)//AT指令应答内容正确
		{
				//next Step
				g_stNB_Handler.StepPt++;
				if(g_stNB_Handler.StepPt >= INIT_STEP_NUM)
				{
						////// GPRS模块状态切换 ///////////////
						g_stNB_Handler.State = NB_STATE_READ_MESS;//切换到下一个流程
						g_stNB_Handler.StepPt = 0;     //clr step
						NB_NetPar.NetType = NET_NO_NET;//无联网状态状态
				}
				else
				{
						g_stNB_Handler.State = NB_STATE_INIT;//继续当前流程		
				}	
		}
		//////////////////////// AT 指令达到重发次数 //////////////////////////	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)//AT指令重发次数到了
		{
				switch(ATCmdIndex)
				{
						default:
						{
								#if SEGGER_RTT_DEBUG_INIT
										SEGGER_RTT_printf(0, "Init Reset\r\n");
								#endif
								g_stNB_Handler.State = NB_STATE_RESET;       //进行复位
								g_stNB_Handler.StepPt = 0;//clr step
								NB_NetPar.NetType = NET_NO_NET;
						}
							break;	
				}
		}
		//////////////////////// AT指令应答错误或超时 /////////////////////////	
		else
		{
				//没有到AT指令重发次数，所以再次发送AT指令
				g_stNB_Handler.State = NB_STATE_WAIT_ACK;//直接再次发送AT指令，然后等待应答
				NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Init[g_stNB_Handler.StepPt];
				NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
		}	
}

static void APP_NB_State_Connect_Proc(uint8_t *RxBuf)
{
    uint8_t ATCmdIndex;
	
		if(g_stNB_Handler.StepPt >= CONNECT_STEP_NUM)
		{
				return;	
		}
	
		ATCmdIndex = s_ATCmdStep_Connnect[g_stNB_Handler.StepPt];
		//////////////////////// AT指令应答正确 ///////////////////////////	
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)//AT指令应答内容正确
		{	           
				//next Step
				g_stNB_Handler.StepPt++;
				if(g_stNB_Handler.StepPt >= CONNECT_STEP_NUM)
				{
						////// NB模块状态切换 ///////////////
						g_stNB_Handler.State = NB_STATE_IDLE;//切换到下一个流程
						g_stNB_Handler.StepPt = 0;//clr step
						NB_NetPar.NetConnSta = CONN_ON;
				}
				else
				{
						g_stNB_Handler.State = NB_STATE_CONNECT_NET;//继续当前流程
				}
		}
		//////////////////////// AT 指令达到重发次数 //////////////////////////	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)
		{
				switch(ATCmdIndex)
				{
//						case NB_AT_MIPCALL_1:   //直接开始下一条指令
//						{
//								g_stNB_Handler.StepPt++;
//								g_stNB_Handler.State = NB_STATE_CONNECT_NET; //继续当前流程
//						}
//								break;
						
						default:
						{
								#if SEGGER_RTT_DEBUG_CONN
										SEGGER_RTT_printf(0, "Connect Reset\r\n");
								#endif
								g_stNB_Handler.State = NB_STATE_RESET;       //进行复位
								g_stNB_Handler.StepPt = 0;//clr step
								NB_NetPar.NetType = NET_NO_NET;
						}
								break;	
				}	
		}
		//////////////////////// AT指令应答错误或超时 /////////////////////////	
		else
		{
				//没有到AT指令重发次数，所以再次发送AT指令
				g_stNB_Handler.State = NB_STATE_WAIT_ACK;//直接再次发送AT指令，然后等待应答
				NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd	
				NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Connnect[g_stNB_Handler.StepPt];
		}	
}

static void APP_NB_State_Mess_Proc(uint8_t *RxBuf)
{
		uint8_t i;
		uint8_t ATCmdIndex;
		char *pTemp   = NULL;
		if(g_stNB_Handler.StepPt >= MESS_STEP_NUM)
		{
				return; 
		}   
		ATCmdIndex = s_ATCmdStep_Mess[g_stNB_Handler.StepPt];
		//////////////////////// AT指令应答正确 ///////////////////////////	 
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)//AT指令应答内容正确
		{
				switch(ATCmdIndex)
				{
						case NB_AT_CGSN_1:
						{
								//save cgsn
								pTemp = strstr((char*)RxBuf, "CGSN:");
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "cmd cgsn\r\n");
								#endif
								if(pTemp != NULL)
								{
										for (i = 0; i < 16; i ++)
										{
												if (((pTemp[5 + i] < '0') || (pTemp[5 + i] > '9')) && 
														((pTemp[5 + i] < 'a') || (pTemp[5 + i] > 'z')) && 
														((pTemp[5 + i] < 'A') || (pTemp[5 + i] > 'Z')))
												{
														break;
												}
										}
										if (i < 16) pTemp[5 + i] = 0x00;
										memcpy(NB_CommPacket.Init_Data.imei, pTemp+5, i);
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "len = %u, imei:%s. \r\n", i, NB_CommPacket.Init_Data.imei);
								#endif
										set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								}
						}
								break;	
						
						case NB_AT_NCCID:
						{
								//save nccid
								pTemp = strstr((char*)RxBuf, "NCCID:");
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "cmd nccid\r\n");
								#endif
								if(pTemp != NULL)
								{
										for (i = 0; i < 32; i ++)
										{
												if (((pTemp[6 + i] < '0') || (pTemp[6 + i] > '9')) && 
														((pTemp[6 + i] < 'a') || (pTemp[6 + i] > 'z')) && 
														((pTemp[6 + i] < 'A') || (pTemp[6 + i] > 'Z')))
												{
														break;
												}
										}
										if (i < 32) pTemp[6 + i] = 0x00;
										
										memcpy(NB_CommPacket.Init_Data.iccid, pTemp+6, i);
								#if SEGGER_RTT_DEBUG_MESS
										SEGGER_RTT_printf(0, "len = %u, nccid:%s. \r\n", i, NB_CommPacket.Init_Data.iccid);
								#endif
										set_task(MEM_WRITE, MEM_STORE_SOLID_ROMDATA);
								}
						}
								break;	
				
						default:
								break;
				}
				//next Step
				g_stNB_Handler.StepPt++;
				if(g_stNB_Handler.StepPt >= MESS_STEP_NUM)
				{
						////// NB模块状态切换 ///////////////
						g_stNB_Handler.State = NB_STATE_CONNECT_NET;//切换到下一个流程
						g_stNB_Handler.StepPt = 0;     //clr step
				}
				else
				{
						g_stNB_Handler.State = NB_STATE_READ_MESS;//继续当前流程
				}   
		}
		//////////////////////// AT 指令达到重发次数 //////////////////////////	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)//AT指令重发次数到了
		{
				#if SEGGER_RTT_DEBUG_MESS
						SEGGER_RTT_printf(0, "Mess Reset\r\n");
				#endif
				g_stNB_Handler.State = NB_STATE_RESET;  //进行复位
				g_stNB_Handler.StepPt = 0;//clr step
				NB_NetPar.NetType = NET_NO_NET;
		}
		//////////////////////// AT指令应答错误或超时 /////////////////////////
		else
		{
				//没有到AT指令重发次数，所以再次发送AT指令
				g_stNB_Handler.State = NB_STATE_WAIT_ACK;//直接再次发送AT指令，然后等待应答
				NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Mess[g_stNB_Handler.StepPt];
				NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
		}
}

static void APP_NB_State_Comm_Proc(uint8_t *RxBuf)
{
		uint8_t i;
    uint8_t ATCmdIndex;  
    static uint8_t errCnt=0;
		char *p   = NULL;
		if(g_stNB_Handler.StepPt >= COMM_STEP_NUM)
		{
			return;	
		} 
		ATCmdIndex = s_ATCmdStep_Comm[g_stNB_Handler.StepPt];
		/************************AT指令应答正确·**************************/	
		if(BACK_TRUE == NB_ATCmdCB.ATCmdResult)/*AT指令应答内容正确*/
		{
				switch(ATCmdIndex)
				{
						case NB_AT_CSQ:
						{
								//save csq
								p = strstr((char*)RxBuf, "+CSQ:");
								#if SEGGER_RTT_DEBUG_COMM
										SEGGER_RTT_printf(0, "cmd csq\r\n");
								#endif
								if(p != NULL)
								{
										NB_CommPacket.Init_Data.CSQ = 0;
										for (i = 0; i < 32; i ++)
										{
												if ((p[5 + i] < '0') || (p[5 + i] > '9'))
												{
														break;
												}
										}
										NB_CommPacket.Init_Data.CSQ = (NB_CommPacket.Init_Data.CSQ * 10) + p[5 + i] - '0';
										
								#if SEGGER_RTT_DEBUG_COMM
										SEGGER_RTT_printf(0, "csq = %u.\r\n", NB_CommPacket.Init_Data.CSQ);
								#endif
								}
						}
								break;
					
						case NB_AT_NQMGS:
						{								
								if(UPLOAD_TYPE == g_stNB_Handler.ucSendType)
								{
										/*本次通讯完成,清除对应的事件*/
										NB_EVENT_CLR(NB_EvtProc.ucUploadEvt,(0x01 << g_stNB_Handler.ucDataID));
								}
							
								NB_EVENT_CLR(g_stNB_Handler.ucCommEvent,(0x01 << g_stNB_Handler.ucDataID));
								errCnt=0;           /*AT指令成功，清除错误计数*/
								NB_TimProc.heartbeatCount = 0;      /*心跳计数清零*/
						}
								break;	
						
						default:
								break;	
				}
			//next Step
			g_stNB_Handler.StepPt++;
			if(g_stNB_Handler.StepPt >= COMM_STEP_NUM)
			{
					/******NB模块状态切换***************/
					/*数据标签来判断是否还有其它数据需要发送，如果有则再次进入comm，没有则退出通讯状态*/
					if(APP_NB_EvtTraverse(TRAVERSE) == false)
					{
							g_stNB_Handler.State = NB_STATE_IDLE;/*切换到下一个流程*/
							g_stNB_Handler.ucCommBusy= 0;/*Comm Complete*/
					}
					else
					{
							g_stNB_Handler.State = NB_STATE_COMM;/*继续当前流程*/		
					}
					
					g_stNB_Handler.StepPt = 0;/**clr step*/
			}
			else
			{
					g_stNB_Handler.State = NB_STATE_COMM;/*继续当前流程*/		
			}		
		}
/************************AT 指令达到重发次数**************************/	
		else if(BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult)
		{
				if(NB_AT_NQMGS == ATCmdIndex)
				{
						g_stNB_Handler.State = NB_STATE_COMM;
						errCnt++;
				}
				
				else if((NB_AT_NMGS == ATCmdIndex) || (errCnt > 3))
				{
						#if DEBUG_LOG
									BSP_LOG("Comm Reset\r\n");
						#endif
						errCnt=0;
						g_stNB_Handler.State = NB_STATE_RESET;
						NB_NetPar.NetType = NET_NO_NET;
				}
				
				g_stNB_Handler.StepPt = 1;//clr step
				g_stNB_Handler.ucCommBusy= 0;	

