han-kaka/UEL020100/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/code/app/app_comm_NB86.c
static void APP_NB_EventProc(uint8_t surEvt, uint8_t* objEvt)
{
    uint8_t ucID=0;
    if(false == NB_EVENT_IS_EMPTY(surEvt)) 
    {
				ucID = Get_CommEvent(surEvt);
				NB_EVENT_SET(*objEvt, (1<<ucID));
    }
}

static uint8_t APP_NB_EvtTraverse(uint8_t mode)
{    
    if(false == NB_EVENT_IS_EMPTY(NB_EvtProc.ucUploadEvt))
    {
        if(mode == TRAVERSE_AND_ADDEVT)  APP_NB_EventProc(NB_EvtProc.ucUploadEvt, &g_stNB_Handler.ucCommEvent);
        return UPLOAD_TYPE;
    }
    else if(false == NB_EVENT_IS_EMPTY(g_stNB_Handler.ucCommEvent))
    {
        //理论上程序无法运行到这里
        g_stNB_Handler.ucCommEvent = 0;
    #if SEGGER_RTT_DEBUG_NB86
        SEGGER_RTT_printf(0, "Event is Error \r\n");
    #endif
        return 0;
    }
    else
    {
        g_stNB_Handler.State = NB_STATE_IDLE;  //切换至IDLE态
        return 0;
    }
}

static void APP_NB_Reset_Init(void)
{                 
    //延时事件添加至主动上传事件中
    //需把延时事件全部添加至主动上传事件中
    g_stNB_Handler.AuthStatus = NOT_AUTH;
    NB_EVENT_SET(NB_EvtProc.ucUploadEvt, COMM_EVENT_INIT);
    g_stNB_Handler.ucCommEvent = 0;
    NB_NetPar.NetType = NET_NO_NET;           //无网络状态连接
    NB_NetPar.NetConnSta = CONN_OFF;
    APP_NB_RetryMessInit();                   //重传相关变量初始化
}

//模块通讯相关变量初始化
void app_comm_init(void)
{
//#if DEBUG_TROPE_FUN
//    PacketHead.TerminalMeageFlowNum = 0x19;
//#endif
		g_stNB_Handler.State = NB_STATE_POWER_ON; 
		g_stNB_Handler.StateOld = NB_STATE_POWER_ON; 
		g_stNB_Handler.StepPt = 0;
		g_stNB_Handler.AuthStatus = NOT_AUTH;
//		BSP_NB_POWERON_SET;
//		nrf_delay_us(1000);
//		BSP_NB_RESET_CLEAR
//		while(1)
//		{}
		NB_EVENT_SET(NB_EvtProc.ucUploadEvt, COMM_EVENT_INIT);//上电需发送一个登录包
		set_task(COMM, COMM_STATE_PROC);     //启动GPRS状态处理任务
}

void APP_NB_TimeProc(uint16_t usPeriod)
{
    NB_msCount += usPeriod;
//    if(GPRS_ATCmdCB.Busy == 1)   //在数据接收时，AT指令也忙碌，这边可能会有冲突，把接收时，忙碌标志去除
//	{
		/*********AT指令应答超时**************/
		if(NB_ATCmdCB.ulTimeOut >= usPeriod)
		{
				NB_ATCmdCB.ulTimeOut -= usPeriod;
				if(NB_ATCmdCB.ulTimeOut < usPeriod)
				{
						NB_ATCmdCB.ATCmdResult = BACK_TIMEOUT;/*超时*/ 			
				}
		}
//	}
		
		if(NB_ATCmdCB.ucByteTimeOut >= usPeriod)
		{
				NB_ATCmdCB.ucByteTimeOut -= usPeriod;
				if(NB_ATCmdCB.ucByteTimeOut < usPeriod)
				{
						NB_ATCmdCB.RxFrameOk = 1;
						set_task(COMM, COMM_CMD_PROC);
				}
		}
		
		/***************** NB 模块延时计 ************************/
		if(g_stNB_Handler.ulDelayCnt >= usPeriod)    
		{
				g_stNB_Handler.ulDelayCnt -= usPeriod;
		}
    else
    {
        g_stNB_Handler.ulDelayCnt = 0;
    }
		
		 /*****************NB 模块状态处理函数*************************/	
		g_stNB_Handler.ulProcCtrTaskPer += usPeriod;
		if(g_stNB_Handler.ulProcCtrTaskPer >= SUB_TASK_PROCCTR_PER)
		{
				g_stNB_Handler.ulProcCtrTaskPer -= SUB_TASK_PROCCTR_PER;
				set_task(COMM, COMM_STATE_PROC);
		}	
		if(NB_msCount >= NB_MS_TO_S)   //ms to S
		{
				NB_msCount =0;
			
				/***************** 心跳包处理 *************************/
				if((CONN_ON == NB_NetPar.NetConnSta) && (AUTH == g_stNB_Handler.AuthStatus))  /*心跳包*/
				{
						NB_TimProc.heartbeatCount++;
						if(NB_TimProc.heartbeatCount >= HEARTBEAT_TIME)
						{
								NB_TimProc.heartbeatCount = 0;
								NB_EVENT_SET(NB_EvtProc.ucUploadEvt, COMM_EVENT_HEARTBEAT);
						}
				}
		}
}


/*模块AT指令解析任务*/
void APP_SubTask_CmdProc(void)
{
		#if SEGGER_RTT_DEBUG_CMDPROC
//			SEGGER_RTT_printf(0, "APP SubTask CmdProc !\r\n");
		#endif
//    nrf_uart_disable(NRF_UART0);
    NB_ATCmdCB.Busy = 0;   
    NB_ATCmdCB.ucRxLen = NB_ATCmdCB.ucRxCnt;
    NB_ATCmdCB.ucRxCnt = 0;
    NB_ATCmdCB.RxFrameOk = 0;
    memcpy(g_stNB_Handler.RxBuf, NB_ATCmdCB.RxBuf, NB_ATCmdCB.ucRxLen);
//    nrf_uart_enable(NRF_UART0);

    NB_ATCmdCB.ATCmdResult = APP_GPRS_ATCmdAckCheck(g_stNB_Handler.RxBuf); 
#if SEGGER_RTT_DEBUG_NB86
		SEGGER_RTT_printf(0, "at cmd result:%d !\r\n", NB_ATCmdCB.ATCmdResult);
#endif
    ////////// 应答错误直接返回 /////////////////////// 
    if(BACK_ERROR == NB_ATCmdCB.ATCmdResult) 
    {
        return;
    }
    ////////// 应答AT指令直接返回,通过APP_SubTask_StateProc 处理 ///
    if(RSP_TYPE_CMD == NB_ATCmdCB.RspType)
    {
        return;
    }
    NB_ATCmdCB.ATCmdResult = NO_BACK;
}


void APP_SubTask_StateProc(void)
{
		static uint8_t ResetTimesCount = 0;
	
    switch(g_stNB_Handler.State)
    {
				case NB_STATE_WAIT_ACK:
        {
						//如果没有结果就直接返回
						if(NO_BACK == NB_ATCmdCB.ATCmdResult)
						{
								return;	
						}  
						//AT应答超时，或者AT指令应答解析错误，则判断是否需要重发
						if((NB_ATCmdCB.ATCmdResult == BACK_ERROR) || (NB_ATCmdCB.ATCmdResult == BACK_TIMEOUT))  
						{
								if(NB_ATCmdCB.ucResendCnt >= NB_ATCmdCB.ucResendTimes)
								{	
										NB_ATCmdCB.ATCmdResult = BACK_PERTIMES_OUT;//重发次数到了
								}
						}
						//根据不同的结果，做相应处理
						if(APP_NB_StateProcTbl[g_stNB_Handler.StateOld] != NULL)
						{
								APP_NB_StateProcTbl[g_stNB_Handler.StateOld](g_stNB_Handler.RxBuf);		
						}
						if((BACK_TRUE == NB_ATCmdCB.ATCmdResult) || (BACK_PERTIMES_OUT == NB_ATCmdCB.ATCmdResult))/*AT指令应答内容正确*/
						{
								//更新StateOld
								g_stNB_Handler.StateOld = NB_STATE_WAIT_ACK;
						}
						NB_ATCmdCB.ulTimeOut = 0;
						NB_ATCmdCB.Busy = 0;       
				}
						break;
				 
        case NB_STATE_POWER_ON:
        {
						if(g_stNB_Handler.ulDelayCnt > 0)
						{
								return;
						}
						if(0 == g_stNB_Handler.StepPt)
						{
								BSP_NB_POWERON_CLEAR;
								BSP_NB_RESET_SET;
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "clear nb poweron and reset !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 1200;      //拉低1.2s
						}
            else if(1 == g_stNB_Handler.StepPt)
						{
								BSP_NB_POWERON_SET;
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "set nb poweron !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 100;  //拉高100ms
								LED_Status = CONN_INDI;            //正在联网LED指示
						}
						else if(2 == g_stNB_Handler.StepPt)
						{
								BSP_NB_RESET_CLEAR;
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "set nb reset !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 7000; //等待7000ms后再操作NB模块
						}
						else//next state
						{
								//一些变量清0
						#if SEGGER_RTT_DEBUG_POWER_ON
								SEGGER_RTT_printf(0, "next state init !\r\n");
						#endif
                NB_NetPar.NetType = NET_NO_NET;//无网络状态连接
								g_stNB_Handler.StateOld = NB_STATE_POWER_ON;	
								g_stNB_Handler.State = NB_STATE_INIT;//开始下一个流程
								g_stNB_Handler.StepPt = 0;	    
						}
				}
						break;
         ///////////// 该状态为GPRS模块POWER_OFF，所以执行完该流程后需POWER_ON /////////////
         // 如该流程直接完成模块的复位，那么执行完该流程后,可开始AT指令流程 //
				case NB_STATE_RESET:  
        {
						if(g_stNB_Handler.ulDelayCnt > 0)
            {
								return;
            }
            if(0 == g_stNB_Handler.StepPt)
						{
								//引脚操作
								BSP_NB_RESET_CLEAR;
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 200; //拉低200ms
								LED_Status = SYS_INDI;     //系统LED指示
						}
						else if(1 == g_stNB_Handler.StepPt)
						{
								//引脚操作
								BSP_NB_RESET_SET;
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 50;
						}
						else//next state
						{
								//一些变量清0
                NB_NetPar.NetType = NET_NO_NET;               //无网络状态连接
								g_stNB_Handler.StateOld = NB_STATE_RESET;	
								g_stNB_Handler.State = NB_STATE_POWER_ON;   //开始下一个流程
								g_stNB_Handler.StepPt = 0;	
								APP_NB_Reset_Init();
								ResetTimesCount++;
								if(ResetTimesCount >=3)
								{
										ResetTimesCount = 0;
										task_flag_struct.closeStaProc = ENABLE;
								#if SEGGER_RTT_DEBUG_RESET
										SEGGER_RTT_printf(0, "Close State Proc\r\n");
								#endif
								}
								// 这边添加复位次数计数，如超过设定复位次数，那么暂时不进行对GPRS的操作 //
								//// 具体实现可关闭定时器里面的周期状态处理函数 /////
						}
        }
						break;
				 
				case NB_STATE_INIT:
        {
						if((g_stNB_Handler.ulDelayCnt > 0) && (task_flag_struct.atReday_F == DISABLE))
            {
								return;
            }
            if(0 == g_stNB_Handler.StepPt)
						{
						#if SEGGER_RTT_DEBUG_INIT
								SEGGER_RTT_printf(0, "init wait nb start !\r\n");
						#endif
								g_stNB_Handler.StepPt++;
								g_stNB_Handler.ulDelayCnt = 10000; //10S NB AT准备就绪超时时间
						}
						else
						{
						#if SEGGER_RTT_DEBUG_INIT
								SEGGER_RTT_printf(0, "init nb has start !\r\n");
						#endif
								g_stNB_Handler.ulDelayCnt = 0;  //计数清0
								task_flag_struct.atReday_F = DISABLE; //AT就绪失能
								g_stNB_Handler.StateOld = g_stNB_Handler.State;
								g_stNB_Handler.State = NB_STATE_WAIT_ACK;
								NB_ATCmdCB.SendATCmdEn = 1; //enable send ATCmd
								NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Init[g_stNB_Handler.StepPt];  
						}
				}
						break;
				
        case NB_STATE_CONNECT_NET:
				{				
						g_stNB_Handler.StateOld = g_stNB_Handler.State; 
						g_stNB_Handler.State = NB_STATE_WAIT_ACK;
						NB_ATCmdCB.SendATCmdEn = 1;//enable send ATCmd
						NB_ATCmdCB.ATCmdPt = s_ATCmdStep_Connnect[g_stNB_Handler.StepPt];
         }
						break;	
				 
